CAMat/app/views/home/index.html.haml

SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = 1 LIMIT 1
---
    %p
      = Feed.find_by_id(1).msg