CAMat/app/controllers/feed_controller.rb

SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT 1  [["id", "1"]]
---
	def edit
		@feed = Feed.find params[:id]

SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "feeds" SET "msg" = 'Gostaria de convidar a todos para participarem da assembléia sobre a greve que vai acontecer em três dias no pátio principal. É muito importante que todos participem porque a situação da nossa universidade está em jogo. Existem muitas questões a serem tratadas então não percam.
---
	def update
		@feed = Feed.find params[:id]
    	@feed.update_attributes!(params[:feed])