CAMat/app/controllers/lockers_controller.rb

  def index
    @lockers = Locker.all
---
SELECT "lockers".* FROM "lockers"

  def occupied_lockers_list
    @lockers = Locker.all
---
SELECT "lockers".* FROM "lockers"