CAMat/app/controllers/raffles_controller.rb

  def unsubscribe
    user = User.find(session[:user_id])
    user.update_attribute(:raffle_id, nil)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "raffle_id" = NULL, "updated_at" = '2015-12-09 17:34:29.289086' WHERE "users"."id" = 1

  def subscribe
    user = User.find(session[:user_id])
    user.update_attribute(:raffle_id, 1)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "raffle_id" = 1, "updated_at" = '2015-12-09 17:29:03.172710' WHERE "users"."id" = 1

  def index
    if is_admin?
      @raffles = Raffle.all
---
SELECT "raffles".* FROM "raffles"

  def show
    id = params[:id]
    @raffle = Raffle.find(id)
---
SELECT "raffles".* FROM "raffles" WHERE "raffles"."id" = ? LIMIT 1  [["id", "1"]]

  def destroy
    @raffle = Raffle.find(params[:id])
    @raffle.destroy
---
SELECT "raffles".* FROM "raffles" WHERE "raffles"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "raffles" WHERE "raffles"."id" = ?  [["id", 1]]

  def edit
    @raffle = Raffle.find(params[:id])
---
SELECT "raffles".* FROM "raffles" WHERE "raffles"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    @raffle = Raffle.find(params[:id])
    @raffle.update_attributes!(params[:raffle])
---
SELECT "raffles".* FROM "raffles" WHERE "raffles"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "raffles" SET "start" = '2015-01-21 00:00:00.000000', "finish" = '2015-12-09 18:50:00.000000', "updated_at" = '2015-12-09 20:43:16.735285' WHERE "raffles"."id" = 1