CAMat/app/controllers/requirement_raffles_controller.rb

INSERT INTO "requirement_raffles" ("created_at", "finish", "locker", "start", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Wed, 09 Dec 2015 15:55:44 UTC +00:00], ["finish", nil], ["locker", nil], ["start", nil], ["updated_at", Wed, 09 Dec 2015 15:55:44 UTC +00:00], ["user_id", nil]]
---
  def create
    @raffle = RequirementRaffle.create(start: params[:start], finish: params[:finish], locker: params[:locker])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "requirement_raffles".* FROM "requirement_raffles" WHERE "requirement_raffles"."locker" = 'A01' LIMIT 1
INSERT INTO "requirement_raffles" ("created_at", "finish", "locker", "start", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Wed, 09 Dec 2015 16:44:23 UTC +00:00], ["finish", nil], ["locker", nil], ["start", nil], ["updated_at", Wed, 09 Dec 2015 16:44:23 UTC +00:00], ["user_id", nil]]
UPDATE "users" SET "requirement_raffle_id" = 1, "updated_at" = '2015-12-09 17:16:09.045304' WHERE "users"."id" = 1
---
  def subscribe
    user = User.find(session[:user_id])
    raffle = RequirementRaffle.find_by_locker(params[:locker])
    if !raffle.present?
      raffle = RequirementRaffle.create(start: params[:start], finish: params[:finish], locker: params[:locker])
      raffle.delay.run_raffle
    end
    user.update_attribute(:requirement_raffle_id, raffle.id)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "requirement_raffle_id" = NULL, "updated_at" = '2015-12-09 17:26:24.391997' WHERE "users"."id" = 1
---
  def unsubscribe
    user = User.find(session[:user_id])
    user.update_attribute(:requirement_raffle_id, nil)

SELECT "requirement_raffles".* FROM "requirement_raffles"
---
  def index
    if is_admin?
      @raffles = RequirementRaffle.all

SELECT "raffles".* FROM "raffles" WHERE "raffles"."id" = 1 LIMIT 1
SELECT "requirement_raffles".* FROM "requirement_raffles" WHERE "requirement_raffles"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    id = params[:id]
    @raffle = RequirementRaffle.find(id)

SELECT "raffles".* FROM "raffles" WHERE "raffles"."id" = 1 LIMIT 1
SELECT "requirement_raffles".* FROM "requirement_raffles" WHERE "requirement_raffles"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "requirement_raffles" WHERE "requirement_raffles"."id" = ?  [["id", 1]]
---
  def destroy
    @raffle = RequirementRaffle.find(params[:id])
    @raffle.destroy