CAMat/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "users".* FROM "users"
---
  def index
    if User.find_by_id(session[:user_id]).admin?
      @users = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def show
    id = params[:id]
    @user = User.find(id)

INSERT INTO "users" ("admin", "created_at", "documento", "email", "nome", "password_digest", "raffle_id", "requirement_raffle_id", "telefone", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
  	@user = User.create(params[:user])