CAMat/app/views/sessions/_log.html.haml

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  .formItem
    = User.find(session[:user_id]).nome