CAMat/app/views/shared/_menu.html.haml

    = link_to 'DADOS DO USUÁRIO', user_path(current_user.id)
  - if current_user == User.find(session[:user_id]) || is_admin?
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

        = link_to 'LISTA DE USUÁRIOS', users_path
      - if Feed.find_by_id(1) != nil
---
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = 1 LIMIT 1

      %li
        = link_to 'INICIAR PERÍODO DE INSCRIÇÃO', edit_raffle_path(Raffle.find_by_id(1))
---
SELECT "raffles".* FROM "raffles" WHERE "raffles"."id" = 1 LIMIT 1